//
//  ErrorManager.m
//  IFlyMFVDemo
//
//  Created by JzProl.m.Qiezi on 16/4/8.
//
//

#import "ErrorManager.h"

@implementation ErrorManager

+(NSString*)errorDescForCode:(int)errorCode{
    NSDictionary* errDic=@{
                           @10031:@"模型正在更新",
                           @10106:@"缺少参数",
                           @10107:@"无效参数值",
                           @10116:@"数据库中模型不存在",
                           @10121:@"数据库中模型已存在",
                           @10407:@"appid校验未通过",
                           @10110:@"引擎授权不足",
                           @10111:@"引擎未初始化",
                           @10113:@"模型数超上限(10个)",
                           @10114:@"超时",
                           @10118:@"无数据",
                           @10310:@"sid为空",
                           @10312:@"音频序列ID为空",
                           @10324:@"无效的sid",
                           @10400:@"数据库异常",
                           @10402:@"没有找到sid",
                           @10503:@"socket异常",
                           @10700:@"引擎异常",
                           @11005:@"用户id无效",
                           @11201:@"应用授权不足",
                           @10106:@"缺少参数",
                           @10116:@"没有查询到模型",
                           @10118:@"没有数据",
                           @10121:@"错误信息:已存在模型或记录",
                           @10121:@"已存在",
                           @10141:@"空组",
                           @10142:@"组内没有该用户",
                           @10143:@"组不存在，未创建",
                           @10144:@"用户数量超过组上限或者组创建数量超过上限",
                           @10212:@"网络关闭",
                           @11600:@"内核异常",
                           @11601:@"注册写音频条数超过上限(9次)",
                           @11602:@"音频截幅",
                           @11603:@"音频信噪比过低",
                           @11604:@"音频能量过低",
                           @11605:@"无音频",
                           @11606:@"音频太短",
                           @11607:@"音频和文本不匹配",
                           @11608:@"音频不够",
                           @11610:@"模型没找到",
                           @11700:@"无人脸",
                           @11701:@"人脸向左",
                           @11702:@"人脸向右",
                           @11703:@"顺时针旋转",
                           @11704:@"逆时针旋转",
                           @11705:@"图片大小异常",
                           @11706:@"光照异常",
                           @11707:@"人脸被遮挡",
                           @11708:@"非法模型数据",
                           @11709:@"输入数据类型非法",
                           @11710:@"输入的数据不完整",
                           @11711:@"输入的数据过多",
                           @14002:@"服务脚本异常",
                           @20001:@"无有效的网络连接",
                           @20002:@"网络连接超时",
                           @20003:@"网络异常",
                           @20004:@"无有效的结果",
                           @20005:@"无匹配结果",
                           @20006:@"录音失败",
                           @20007:@"未检测到语音",
                           @20008:@"音频输入超时",
                           @20009:@"无效的文本输入",
                           @20010:@"文件读写失败",
                           @20011:@"音频播放失败",
                           @20012:@"无效的参数",
                           @20013:@"文本溢出",
                           @20014:@"无效数据",
                           @20015:@"用户未登陆",
                           @20016:@"无效授权",
                           @20017:@"被异常打断",
                           @20018:@"版本过低",
                           @20999:@"未知错误",
                           @21001:@"没有安装语音组件",
                           @21002:@"引擎不支持",
                           @21003:@"初始化失败",
                           @21004:@"调用失败",
                           @21005:@"引擎繁忙",
                           @22001:@"本地引擎未初始化",
                           @22002:@"本地引擎无资源",
                           @22003:@"本地引擎内部错误",
                           @22004:@"本地唤醒引擎被异常打断",
                           };
    NSNumber * errNum=[NSNumber numberWithInt:errorCode];
    return [errDic objectForKey:errNum];
}

@end
